In [1]:
import pandas as pd

# Q1

Q1. List any five functions of the pandas library with execution.

In [2]:
# df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv"):
# '''it is used to read the csv files from web or excel sheet,'''
# df.head()
# df.dtypes
# df.describe()
# pd.Categorical(df['Survived'])

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

In [9]:
df.head() #:it is used to read the first five line of data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df.dtypes #:it is used to show the data tyes of all the columns

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [11]:
df.describe() #it gives the overall summary of data like mean mode mediann standard deviation

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [13]:
pd.Categorical(df['Survived'])  #it gives the figure of number of unique data present in that column and also show the unique

[0, 1, 1, 1, 0, ..., 0, 1, 0, 1, 0]
Length: 891
Categories (2, int64): [0, 1]

# Q2:

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [50]:
data1 = {
        "A":[1,2,3,4],
       "B":[4,5,6,7],
       "C":["hi" , "data","science","ml"],
        "D":[8,5,6,2]} 
data1['index']=[i for i in range(1,2*len(data1)) if i%2!=0]
data1=pd.DataFrame(data1)
data1.set_index('index',inplace=True)
data1

       A  B        C  D
index
1      1  4       hi  8
3      2  5     data  5
5      3  6  science  6
7      4  7       ml  2

# Q3:

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [58]:
dummy_data={"Values":[10, 20, 30, 40, 50],}
dummy_data=pd.DataFrame(dummy_data)
print(dummy_data)
rq_sum=0
for i in range(3):
    rq_sum=rq_sum+dummy_data.Values[i]
print("Sum=",rq_sum)

   Values
0      10
1      20
2      30
3      40
4      50
Sum= 60

# Q4:

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [61]:
df=pd.DataFrame({"Text":["Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised i"]})
df

                                                Text
0  Lorem Ipsum is simply dummy text of the printi...

In [63]:
df["Word_Count"]=df["Text"].apply(lambda x:len(x.split()))

In [64]:
df

                                                Text  Word_Count
0  Lorem Ipsum is simply dummy text of the printi...          64

# Q5 :

Q5. How are DataFrame.size() and DataFrame.shape() different?

## Ans:
## dataframe.size :
Return : Returns size of dataframe/series which is equivalent to total number of elements.<br>That is rows x columns.

## dataframe.shape:
Return : Returns tuple of shape (Rows, columns) of dataframe/seriesdata1.size

In [72]:
print(data1.shape)
print(data1.size)

(4, 4)
16

# Q6:

Q6. Which function of pandas do we use to read an excel file?

The funtion used for reading a excel file is:<br>
pd.read_excel("name of file ")

# Q7:

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [80]:
data2={"E-mails":["data.science@pwskills.com","shyam223@google,com",'rambabber@microsoft.com',"python13@forest.com"]}

In [83]:
data2=pd.DataFrame(data2)
data2

                     E-mails
0  data.science@pwskills.com
1        shyam223@google,com
2    rambabber@microsoft.com
3        python13@forest.com

In [87]:
data2["Username"]=data2["E-mails"].apply(lambda x:x.split(sep='@')[0])
data2

                     E-mails      Username
0  data.science@pwskills.com  data.science
1        shyam223@google,com      shyam223
2    rambabber@microsoft.com     rambabber
3        python13@forest.com      python13

# Q8:

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [131]:
df=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [143]:
req=df.loc[(df['A']>5) & (df['B']<10)]
req

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Q9:

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [153]:
df2=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [155]:
print("mean:")
print(df2.mean())
print("Median:")
print(df2.median())
print("Standard Deviation:")
print(df2.std())

mean:
A    5.6
B    4.0
C    3.8
dtype: float64
Median:
A    6.0
B    3.0
C    4.0
dtype: float64
Standard Deviation:
A    3.049590
B    3.162278
C    2.387467
dtype: float64

# Q10:

Q10. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [156]:
import pandas as pd

In [160]:
data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

df_reindexed = df.reindex([2, 1, 0])

 
df

   name  age
0  John   25
1  Jane   30
2   Bob   35

In [161]:
df_reindexed

   name  age
2   Bob   35
1  Jane   30
0  John   25

In [163]:
data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

for index, row in df.iterrows():

    print(row['name'], row['age'])

ValueError: too many values to unpack (expected 2)